{"data":{"markdownRemark":{"html":"<p>A common beginner mistake in Go is forgetting to allocate the space for a <code>map</code>. Declaring variables with the map type will only default the <code>map</code> to <code>nil</code>. If you add an item to a <code>nil</code> map you will get a panic error. Let's see some examples of using maps correctly and incorrectly.</p>\n<h2>How To Use Maps Incorrectly</h2>\n<p>Consider this <code>map</code> declaration:</p>\n<pre><code>var bankAccounts map[string]float64\n</code></pre>\n<p>We've declared the variable <code>bankAccounts</code> of type map. If we try to add an item to this map we'll get an error.</p>\n<pre><code>bankAccounts[\"123-456\"] = 100.00\npanic: assignment to entry in nil map\n</code></pre>\n<p>Since we didn't initialize the map it is <code>nil</code> by default.</p>\n<p>Consider this next example; another common mistake. We have this Person struct:</p>\n<pre><code>type Person struct {\n  Name string\n  BankAccounts map[string]float64\n}\n</code></pre>\n<p>Let's initialize a new Person, with only a name, and immediately add an item to the Person.BankAccounts map.</p>\n<pre><code>p := Person{Name: \"Keith\"}\np.BankAccounts[\"123-456\"] = 100.00\n</code></pre>\n<p>We initialized the struct so the map should be initialized as well, right? Let's build it and see if it succeeds.</p>\n<pre><code>panic: assignment to entry in nil map\n</code></pre>\n<p>Whoops! No. The oversight here is not explicitly allocating and initializing the map. Again, we tried to add an item to a nil map and our program panicked. Now let's see how to handle maps correctly.</p>\n<h2>How To Use Maps Correctly</h2>\n<p>Maps, under the covers, reference data structures that must be initialized before use. There are two options we can pursue:</p>\n<ul>\n<li>use the built-in make function</li>\n<li>use a map literal</li>\n</ul>\n<h3>The Built-In Make Function</h3>\n<p>The definition of <code>make</code> is:</p>\n<blockquote>\n<p>Allocates and initializes an object of type slice, map, or chan (only). An empty map is allocated with enough space to hold the specified number of elements. The size may be omitted, in which case a small starting size is allocated.</p>\n</blockquote>\n<p>By simply calling this function with an initial capacity we can start utilizing the map immediately.</p>\n<pre><code>var bankAccounts map[string]float64\nbankAccounts = make(map[string]float64, 1)\nbankAccounts[\"123-456\"] = 100.00\n</code></pre>\n<p>We allocated and initialized a map with enough space to hold one element. We then successfully added a new element afterwards. Let's see the previous example where we used a Person struct type.</p>\n<pre><code>p := Person{Name: \"Keith\"}\np.BankAccounts = make(map[string]float64, 1)\nbankAccounts[\"123-456\"] = 100.00\n</code></pre>\n<p>Once again we made sure we allocated and initialized the map. We can improve the previous example by initializing a map when we initial a Person.</p>\n<pre><code>p := Person{Name: \"Keith\", BankAccounts: make(map[string]float64, 1)}\n</code></pre>\n<p>This will work as well; either way works. Using <code>make</code> is ideal when you know the number of elements will be added to the map.</p>\n<h3>A Map Literal</h3>\n<p>If we don't know the initial size we can omit the size in the <code>make</code> function or use a map literal instead.</p>\n<pre><code>p := Person{Name: \"Keith\", BankAccounts: map[string]float64{} }\n</code></pre>\n<p>This is a smaller map that will grow as we add items to it.</p>\n<p>Sometimes you may not want to or cannot immediately initialize a map when you initialize the struct it's contained within. In any case, you must do so when you first use the map.\nLet's, again, initialize a new Person:</p>\n<pre><code>p := Person{Name: \"Keith\"}\n</code></pre>\n<p>Later in your code you want to add an item to the <code>Person.BankAccounts</code> map. Before doing so you remember, or check, that it's nil so you initialize a new map using <code>make</code> or a map literal.</p>\n<pre><code>bankAccts := make(map[string]float64, 2)\nbankAccts[\"123-456\"] = 100.00\nbankAccts[\"456-789\"] = 75.00\np.BankAccounts = bankAccts\n</code></pre>\n<h2>Make vs Map Literal?</h2>\n<p>Most of the time you'll use <code>make</code>; especially if you know the number of elements you'll be adding to the map. Remember, the second argument to <code>make</code> is the initial size, not the max number of elements a map can hold. A map will grow as it's capacity gets fuller.</p>\n<p>What if you don't know the number of elements, what do you provide as the initial size to make? You could use a small number, zero, or omit it entirely. Note that using zero or omitting the size (ie,<code>make(map[string]float64)</code>) is fundamentally the same as using map literals (ie, <code>map[string]float64{}</code>).</p>\n<h2>Conclusion</h2>\n<p>Forgetting to initialize maps is often overlooked. Just remember to always initialize maps when you can and check for nil maps (ie, compare the map to nil) to initialize maps before using them. Utilize the make function when you know the size.</p>\n<p>🤙 Mahalo for reading!</p>","frontmatter":{"title":"Go Gotcha: Nil Maps","date":"2018-06-11T08:00:00.000Z"}}},"pageContext":{}}