{"data":{"markdownRemark":{"html":"<blockquote>\n<p>TLDR: the final demo and code can be found <a href=\"https://jsfiddle.net/keithalpichi/bxhedode/\">here</a></p>\n</blockquote>\n<h2>Goal</h2>\n<p>The goals we will achieve today are the following:</p>\n<ul>\n<li>to select an image to preview</li>\n<li>to preview the selected image</li>\n</ul>\n<p>Implementing the first point is trivial. However, the second will require the use of a FileReader and Javascript events to handle the image selection event.</p>\n<h2>Step 1: Image Selector</h2>\n<p>First we'll provide an HTML input with the type as file.</p>\n<pre><code>&#x3C;input type=\"file\" />\n</code></pre>\n<p>This will render a button with the title \"Choose File\". Simply clicking on the button will open a window so you can select a file. Since we only want to allow image files we can provide the accept attribute. It now will look like this:</p>\n<pre><code>&#x3C;input type=\"file\" accept=\"image/*\" />\n</code></pre>\n<p>This attribute takes a comma-separated list of allowed file extensions or MIME types. Here we are accepting any image type.</p>\n<p>At the moment, selecting a file won't show any changes. Let's build the image previewer next to display the selected image.</p>\n<h2>Step 2: Image Previewer</h2>\n<p>We will need an img element to display the selected image. Before an image is selected we will show a default image.</p>\n<pre><code>&#x3C;img src=\"http://placehold.it/75X75\"/>\n&#x3C;input type=\"file\" accept=\"image/*\" />\n</code></pre>\n<p>What we want to do now is listen for the change event that occurs when an image is selected. We'll then have access to the selected file. Before we do we need to update the HTML elements with IDs so we can select them with Javascript.</p>\n<pre><code>&#x3C;img id=\"img\" src=\"http://placehold.it/75X75\"/>\n&#x3C;input type=\"file\" id=\"file\" accept=\"image/*\" />\n</code></pre>\n<p>Now we'll start to build the Javascript. We first need a FileReader. This will allow us to read the contents of the selected file.</p>\n<pre><code>const reader = new FileReader();\nconst fileInput = document.getElementById(\"file\");\nfileInput.addEventListener('change', e => {\n  const f = e.target.files[0];\n  reader.readAsDataURL(f);\n})\n</code></pre>\n<p>In this example, we instantiate a new FileReader. When a file is selected the change event will be emitted. We then call the FileReader's readAsDataURL function with the file. This function will start to read the file as a data URL.\nWe'll also need to implement the onload event handler that gets called when the load event is emitted. This event occurs when the file is finished being read.\nconst reader = new FileReader();\nconst fileInput = document.getElementById(\"file\");\nconst img = document.getElementById(\"img\");\nreader.onload = e => {\nimg.src = e.target.result;\n}\nfileInput.addEventListener('change', e => {\nconst f = e.target.files[0];\nreader.readAsDataURL(f);\n})\nThe result of the file reader will be a base64 encoded string that we can provide to the image element's src attribute. That's it!\nStyling\nIt works well but it looks like it was built in the early 2000s. Let's make some styling changes such as getting rid of the default \"Choose File\" button and allowing the image itself be the source of the click event that opens the image selection window.\nBy simply wrapping the img with a label element we can make the image act as the \"button\" that opens the image selection window.\n<label for=\"file\"><img id=\"img\" src=\"http://placehold.it/75X75\"/></label>\n<input type=\"file\" id=\"file\" />\nThe important concept is the for attribute. By matching this value with the file input's ID, it let's HTML know that this label is related to that input and that the label will now open the image selection window. Since we're wrapping the image with the label it makes it look like clicking on the image opens the image selection window.\nIf you try clicking on the image now the image selection window will open. Sweet, huh? However, the \"Choose File\" button is still present. With a simple change to CSS we can hide it.</p>\n<h1>file {</h1>\n<p>  display: none;\n}\nNow, only the image is present. Cool! It's important to know that we don't want to get rid of the file input, we just want to hide it.\nConclusion\nBuilding HTML forms is common in web development. Someday, hopefully, you'll get requests to build a UI for users to select, preview, and upload images. I hope this tutorial has made it clear that building an image selector and image previewer is not only simple but can be done in vanilla Javascript using the browsers native API.\nYou can find the final working demo and code here\nWhat About File Uploads?\nOkay, selecting an image and seeing it render in the browser is nice but it's not very practical. Usually you want to perform some other steps afterwards; such as upload it somewhere, save it to S3, or send it to our server to do some image manipulation or machine learning. A tutorial on how to upload a file to a server will be a future article. For now, follow me to get notified when that article is published and start building those beautiful image selectors and previewers.\n🤙 Mahalo for reading!</p>","frontmatter":{"title":"","date":"2018-05-28T08:00:00.000Z"}}},"pageContext":{}}