{"data":{"markdownRemark":{"html":"<p>Reading from and writing to CSV files is extremely simple with Go's encoding/csv package. Today, I'm going to discuss just how simple it is.</p>\n<h2>Introduction</h2>\n<p>The standard library is very robust. Consider standard library packages over bulky third-party frameworks. Essentially, a lot of your needs as a Go engineer can be fulfilled with the standard library. So it's important to understand and use the built-in packages Go has to offer.</p>\n<p>This is one article in my Go's Standard Library By Example article series that provides simplified explanations and practical examples of Go's standard library.</p>\n<h3>Level of Difficulty: Beginner</h3>\n<h3>Prerequisites: Basic understanding of \"io\" and \"os\" packages</h3>\n<h2>Reading From CSVs</h2>\n<p>To read from a CSV file it must be opened with os.Open. This will return a pointer to the file descriptor, os.File. Now since the file implements the io.Reader interface it can be given to the csv.NewReader to make a csv.Reader.</p>\n<p>Let's say we have this CSV file named \"foo.csv\":</p>\n<table>\n<thead>\n<tr>\n<th>ID</th>\n<th>Name</th>\n<th>Email</th>\n<th>Revenue</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>123</td>\n<td>John</td>\n<td>john@example.com</td>\n<td>$141,987</td>\n</tr>\n<tr>\n<td>456</td>\n<td>Sam</td>\n<td>sam@example.com</td>\n<td>$905,234</td>\n</tr>\n</tbody>\n</table>\n<p>We then can open it and create a <code>csv.Reader</code>.</p>\n<pre><code>csvFile, err := os.Open(\"./foo.csv\")\nif err != nil {\n  panic(err)\n}\ndefer csvFile.Close()\n\ncsvReader := csv.NewReader(csvFile)\n</code></pre>\n<p>Let me take a second to highlight the beauty of interfaces. Since <code>csv.NewReader</code> accepts the <code>io.Reader</code> interface you can provide it with any source besides CSV files as long as it fulfills the interface. It doesn't have to be a file. You can also use:</p>\n<ul>\n<li><code>strings.NewReader</code> to create a reader from a string</li>\n<li><code>bytes.NewReader</code> to create a reader from a byte slice</li>\n<li><code>bufio.NewReader</code> to create a buffered reader from an existing reader</li>\n</ul>\n<blockquote>\n<p>Pro Tip: testing and debugging with these are extremely useful</p>\n</blockquote>\n<h2>Reading a Single Row</h2>\n<p>You're now ready to read a single row with <code>csv.Reader.Read</code>.</p>\n<pre><code>row, err := csvReader.Read()\n</code></pre>\n<p>It returns a string slice and an error. If you've hit the end of the file the error will be <code>io.EOF</code>.</p>\n<p>This should go without saying but each string in the slice are in the same order as the CSV. By knowing the order of the cells in the CSV header you can index the corresponding cell in another row. For example, since the first row of this file is the header, the slice would be <code>[]string{\"ID\", \"Name\", \"Email\", \"Revenue\"}</code>. So,</p>\n<pre><code>n := row[1] // n == \"Name\"\n</code></pre>\n<p><code>n</code> equals \"Name\". All subsequent rows will contain the same order. Cool! We have read the header row successfully. From here we can keep reading each row one at a time. If you want to read every row, a practical way is to use a for-loop and handle each error like this:</p>\n<pre><code>for {\n  row, err := csvReader.Read()\n  if err == io.EOF {\n    break\n  } else if err != nil {\n    panic(err) // or handle it another way\n  }\n  // use the `row` here\n}\n</code></pre>\n<p>We continuously read each row, break if we hit the end, panic if we hit another error, or use the data in the row if no error exists.</p>\n<h2>Reading the Remaining Rows</h2>\n<p>You can also read the remaining rows from the <code>csv.Reader</code> with <code>csv.ReadAll</code>. It returns a slice of string slices and an error. When it reaches the end of the file it does not return an error.</p>\n<pre><code>rows, err := csvReader.ReadAll() // `rows` is of type [][]string\nif err != nil {\n  panic(err)\n}\nfor i, row := range rows {\n  // process the `row` here\n}\n</code></pre>\n<h2>Writing To CSVs</h2>\n<p>To write to a CSV file, the file must first be created with <code>os.Create</code>. If the file exists already it will be overwritten. Just like <code>os.Open</code>, this will also return a pointer to the file descriptor, <code>os.File</code>. The file, again, implements the i<code>o.Writer</code> interface; thus it can be given to the <code>csv.NewWriter</code> to make a <code>csv.Writer</code>.</p>\n<pre><code>csvFile, err := os.Create(\"./bar.csv\")\nif err != nil {\n  panic(err)\n}\ndefer csvFile.Close()\n\ncsvWriter := csv.NewWriter(csvFile)\n</code></pre>\n<h2>Writing a Single Row</h2>\n<p>Now we're ready to write to the file with <code>csv.Writer.Write</code>. This function takes a slice of strings.</p>\n<pre><code>err := csvWriter.Write([]string{\"678\", \"Jane\", \"jane@example.com\", \"$548,980\"})\n</code></pre>\n<p>Surprisingly, this does not write to the file. It only writes to a buffer. When you're finished writing to the buffer and want to write to the file you must call <code>csv.Writer.Flush</code>. You can think of this \"flushing\" the buffered data to the underlying writer.</p>\n<pre><code>csvWriter.Flush()\nerr := csvWriter.Error()\nif err != nil {\n  // an error occurred during the flush\n}\n</code></pre>\n<h2>Writing Many Rows</h2>\n<p>To write many rows and flush at once you can use <code>csv.Writer.WriteAll</code>.</p>\n<pre><code>rows := [][]string{\n  { \"123\", \"John\", \"john@example.com\", \"$141,987\"},\n  { \"456\", \"Sam\", \"sam@example.com\", \"$905,234\"},\n  { \"678\", \"Jane\", \"jane@example.com\", \"$548,980\"},\n}\nerr := csvWriter.WriteAll(rows)\n</code></pre>\n<h2>Conclusion</h2>\n<p>This package has to be the most simplest package to learn and use. It's main focus is reading from and writing to CSV files. You simply create readers and writers and call a few functions. What you do with with the CSV data after reading and before writing is what other standard library packages are useful for. You can:</p>\n<ul>\n<li>convert cells, which when read are a string type, to basic data types with the \"strconv\" package. You'll also convert these types back to strings with this package when you want to write a row</li>\n<li>use the \"strings\" package to perform string manipulations like trimming spaces and splitting on comma delimiters</li>\n<li>use concurrency primitives such as channels and goroutines to process each row concurrently instead of sequentially</li>\n<li>use the \"math\" package to perform math calculations</li>\n</ul>\n<p>🤙 Mahalo for reading!</p>","frontmatter":{"title":"Go's Standard Library By Example: encoding/csv","date":"2018-05-21T08:00:00.000Z"}}},"pageContext":{}}