{"data":{"markdownRemark":{"html":"<h2>Don't Underestimate Stack overflow</h2>\n<p>First off, this achievement may not be a ground-breaking feat but I was happy my approach to answering questions was increasing my reputation at a pretty fast rate. I've read articles how some people hacked their way to higher reputation but I am going to show you how I did it... by giving a genuine helpful response as fast as I could after a question was posted.</p>\n<p>I'm pretty confident in Javascript, React, Redux, Node, and Express and I wanted to share my knowledge and experience with the community. However, I didn't know the best way to. I've used Quora in the past for other types of questions (<a href=\"https://www.quora.com/profile/Keith-Alpichi\">I even received writing awards for it</a>) but for helping others with their technical questions there is no better place than Stack Overflow. I mean, SO was made for this.</p>\n<h2>How I Did It</h2>\n<ul>\n<li>I made sure I understood <a href=\"https://stackoverflow.com/help/whats-reputation\">the various ways Stack Overflow gives reputation points</a> and <a href=\"https://stackoverflow.com/help/how-to-answer\">how to give good answers</a></li>\n<li>I set a filter with Stack Exchange for questions with specific tags. When a new question was posted I could have Stack Exchange email me new questions with those tags within fifteen minutes</li>\n<li>I downloaded the Stack Exchange mobile app and used that to add comments and answers when I wasn't using the browser</li>\n<li>I strived to provide a genuine and helpful answer before someone else did</li>\n<li>I strived to understand the question by leaving comments so I could provide a relevant and helpful response</li>\n<li>I left external links relevant to the question <em>and</em> answer such as documentation, other SO posts, articles, and more</li>\n<li>I formatted my responses to be readable because no one wants to read something they can't understand and follow</li>\n</ul>\n<p>Little by little my reputation started to rise. What's cool is that past answers continued to contribute to my reputation. This encouraged me to continue finding questions to answer. As a result I went from a reputation less than 100 to 550 within two months and made \"Top 8% This Year\".</p>\n<h2>Set Your Filters and Get To work</h2>\n<p>So go on, set your filters, and start answering. Together we can all provide quality answers to other software engineers who need them fast. We all know it sucks when we're coding, get stuck, and need answers quick. Be the person on the other end giving a great answer and you will be rewarded.</p>\n<p>This may not be the most efficient approach but it worked for me and I enjoyed it. If you have any other tips or advice please let me know.</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"tl\" dir=\"ltr\">Beef &amp; Bison Cocoa Chili <a href=\"https://t.co/bYPf0IqDfP\">https://t.co/bYPf0IqDfP</a></p>&mdash; Keith Alpichi (@KeithAlpichi) <a href=\"https://twitter.com/KeithAlpichi/status/1069803904307744773?ref_src=twsrc%5Etfw\">December 4, 2018</a></blockquote>","frontmatter":{"title":"How I went from a Stack Overflow reputation of 100 to 550 in under two months","date":"2017-05-13T12:00:00Z"}}},"pageContext":{}}