{"data":{"markdownRemark":{"html":"<p>AWS's endlessly growing amount of services and behemoth documentation can make getting started extremely intimidating and confusing. Some common questions that you might have are:</p>\n<ul>\n<li>Where do I start?</li>\n<li>How do I do X?</li>\n<li>Where do I find documentation on Y?</li>\n<li>How can I try service Z out without paying anything or much at all?</li>\n<li>Should I use this or that service for my application?</li>\n</ul>\n<p>This guide helps to point you in the right direction to answer some of those questions. It will help:</p>\n<ul>\n<li>build a starting foundation for you to build upon using best practices</li>\n<li>suggest important operations with a nudge towards documentation to get you familiar with common AWS services (links are provided)</li>\n<li>suggest resources vital to your development and operations of your applications</li>\n</ul>\n<p>This guide will <em>not</em>:</p>\n<ul>\n<li>provide a step-by-step guide to building applications</li>\n<li>provide in-depth coverage of AWS services</li>\n</ul>\n<p>Let's get to it.</p>\n<h2>Create an Account</h2>\n<blockquote>\n<p>Services involved: IAM</p>\n</blockquote>\n<p>Start by creating an AWS account with a very strong password. This will create an account and a root user. The root user, by default, is granted full administrative privileges. Later on you'll create yourself another IAM user with less privileges and use the root user to manage that user's privileges.</p>\n<h3>Enable MFA for the Root User</h3>\n<p>Immediately <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa_enable_virtual.html#enable-virt-mfa-for-root\">enable MFA for the root user</a> to lock it down. You won't be using this user to perform anything other than managing your non-root user, account settings, <a href=\"https://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/billing-what-is.html\">billing information</a>, and billing notifications</p>\n<h2>Create a Billing Alarm</h2>\n<blockquote>\n<p>Services involved: CloudWatch and SNS</p>\n</blockquote>\n<p>Create a <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/monitor_estimated_charges_with_cloudwatch.html#creating_billing_alarm_with_wizard\">billing alarm</a> to get notified when your monthly bill exceeds an amount you configure. If you're testing out services that accrue charges and forget to stop and terminate the service it can continue to accrue charges without you knowing. Some examples include a running EC2 instance and data left stored in S3 and EBS.</p>\n<p>CloudWatch will monitor your billing report and trigger SNS to notify you through email when the threshold is exceeded. Setting this up should help you feel relieved knowing that upon notification you can quickly log-in to the AWS Console to take action to prevent any further charges.</p>\n<p>Remember, all services charge differently so <a href=\"https://aws.amazon.com/pricing/\">make sure you understand how the service charges money</a> before using it. Some services are free, others charge for what and how much you use, and others charge by how much time you use it for.</p>\n<h2>Get Familiar with <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/introduction.html\">IAM</a></h2>\n<blockquote>\n<p>Services involved: IAM</p>\n</blockquote>\n<p>IAM is the Identity and Access Management service that helps you securely control access to AWS resources. You use IAM to control who is authenticated (signed in) and authorized (has permissions) to use resources.</p>\n<p>Everything you do in AWS will first be authorized by IAM. When you click a button in the AWS console, make an API request to AWS within your app, or send a CLI request it will first go through IAM to confirm you, or the person or application making the request, are authorized. It is easy to initially ignore IAM since it's not the most exciting service. However, don't do this. You'll quickly face headaches and errors trying to do the simplest things with other services. Nearly all services depend on IAM so learn it well.</p>\n<h3><a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/best-practices.html\">Prioritize IAM Best Practices</a></h3>\n<p>AWS recommends a list of best practices to help secure your resources.</p>\n<h3>Create a Non-Root User</h3>\n<p>Now that you know the basics of IAM, create another IAM user for yourself to use. Provide this user the minimum necessary IAM permissions to perform the tasks you need to perform. You can, however, provide this user the <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/access_policies_job-functions.html#jf_administrator\">AdministratorAccess</a> policy that grants administrative privileges but that essentially makes this user the root user.</p>\n<h2>Take Advantage of the <a href=\"https://aws.amazon.com/free/\">Free-Tier</a> Offering</h2>\n<p>AWS offers some services for free forever, for a free-trial, and for the first 12-months of signing up. As a new user make sure to take advantage of all of these offerings, especially those that expire within 12 months.</p>\n<h2>Utilize the various <a href=\"https://aws.amazon.com/tools/\">tools</a> to interact with AWS services</h2>\n<blockquote>\n<p>Services involved: Console, CLI, and SDK</p>\n</blockquote>\n<p>You can interact with AWS in three ways:</p>\n<ul>\n<li>through the AWS <a href=\"https://docs.aws.amazon.com/awsconsolehelpdocs/latest/gsg/getting-started.html\">Console</a> (ie, the web application at aws.amazon.com)</li>\n<li>through the AWS <a href=\"https://aws.amazon.com/cli/\">CLI tool</a></li>\n<li>through the AWS SDK in your favorite programming language</li>\n</ul>\n<h3>AWS Console Usage Suggestions</h3>\n<ul>\n<li>great for beginners to get a feel for how AWS looks and feels</li>\n<li>great for visually interacting with AWS</li>\n<li>great for testing out services through a step-by-step user interace</li>\n<li>great for performing administrative tasks like those you can only perform within the Console</li>\n<li>not so great for automating tasks since operations are performed manually</li>\n</ul>\n<h3>AWS CLI Usage Suggestions</h3>\n<ul>\n<li>great for interacting with AWS through a shell</li>\n<li>great for automating tasks and achieving \"Infrastructure as Code\"</li>\n<li>great for CI/CD and DevOps</li>\n</ul>\n<h3>AWS SDK Usage Suggestions</h3>\n<ul>\n<li>great for interacting with AWS within application code</li>\n</ul>\n<h3>Use <a href=\"https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/Welcome.html\">CloudFormation</a> Extensively</h3>\n<p>Creating applications on AWS most often requires using many resources together. Manually provisioning and configuring these resources is tedious and error prone. What if you could provide AWS a declarative configuration file that lists all the details of the resources you're trying to build including how they interact with each other? With CloudFormation you can do this.</p>\n<p>AWS CloudFormation takes care of provisioning and configuring resources for you. You don't need to individually create and configure AWS resources and figure out what's dependent on what. You provide a JSON or YML template and AWS CloudFormation handles all of that for you.</p>\n<p>This concept of declaring infrastructure within declarative configuration files is called \"Infrastructure as Code\" and it's worth investing time to pick up and use. Once you've got a feel for the AWS Console try switching over to using only CloudFormation. You'll no longer use the Console other than to use the GUI to <em>view</em> something or perform administrative tasks.</p>\n<h2>Bookmark Essential AWS Documentation Reference</h2>\n<p>As an AWS user it's impossible to remember all the APIs, SDK function arguments, IAM policies, and CloudFormation resources and property types. Below are the essential documentation I suggest you bookmark for quick reference.</p>\n<ul>\n<li><a href=\"https://docs.aws.amazon.com/\">AWS Services Documentation</a>- central hub for documentation on all AWS services</li>\n<li><a href=\"https://docs.aws.amazon.com/cli/latest/reference/\">AWS CLI Reference</a>- documentation on the AWS CLI</li>\n<li><a href=\"https://aws.amazon.com/tools/\">AWS SDK Reference</a>- documentation on the various AWS SDK's</li>\n<li><a href=\"https://docs.aws.amazon.com/general/latest/gr/aws-arns-and-namespaces.html\">AWS Service ARNs and Namespaces</a>- documentation on the service Amazon Resource Names that uniquely identify AWS resources</li>\n<li><a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/reference_policies_actions-resources-contextkeys.html\">IAM Policy Reference</a>- documentation on all IAM policies</li>\n<li><a href=\"https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-template-resource-type-ref.html\">Resource and Property Types Reference</a>- documentation for all resource and property types supported by CloudFormation</li>\n</ul>\n<h2>Where to Next?</h2>\n<p>Follow the documentation depending on what you're trying to learn or achieve. Take what you've learned and start building. Refer back to your documentation bookmarks when you need clarification on a service.</p>","frontmatter":{"title":"AWS Beginner Quick Start Guide","date":"2019-08-05 08:00","tags":["aws"]}}},"pageContext":{}}