{"data":{"markdownRemark":{"html":"<p>The first time I came across the pattern of the <code>render</code> prop was in v3 of the wonderful React-Router library. That was nearly 2 years ago. I’ve used it here and there but I didn’t realize all the beauty behind it until I recently learned it was being used as an <a href=\"https://cdb.reacttraining.com/use-a-render-prop-50de598f11ce\">alternative to HOC’s</a>. It was also introduced into React 16. The <code>render</code> prop was clearly a pattern I needed to revisit!</p>\n<p>Unfortunately for me, my company has been using an older version of React and I’m so behind with all the updates to React. However, since it’s just a pattern it doesn’t matter the version because it can be implemented in just a few lines of code. Let me first define what this pattern is and then we’ll go through an example to see how it works.</p>\n<h2>What is a Render Prop?</h2>\n<p>In the React documentation it is:</p>\n<blockquote>\n<p>a simple technique for sharing code between React components using a prop whose value is a function</p>\n</blockquote>\n<p>Huh? Okay. Let’s turn to <a href=\"https://medium.com/@mjackson\">Michael Jackson</a>, who explains in his article <a href=\"https://cdb.reacttraining.com/use-a-render-prop-50de598f11ce\">Use a Render Prop!</a> that a render prop is:</p>\n<blockquote>\n<p>a function prop that a component uses to know what to render</p>\n</blockquote>\n<p>Better? The definition may be hard to grasp. So let’s build something to learn how it works.</p>\n<h2>A Simple Pop-Up Modal</h2>\n<p>What we’ll build is a simple pop-up modal. Let’s think about how a modal works:</p>\n<ul>\n<li>A modal can pop-up (open) by some action, normally displaying in front of or on top of other HTML elements</li>\n<li>A modal can close, by itself or by some other action</li>\n</ul>\n<p>Let’s now think about how we can modularize this idea:</p>\n<ul>\n<li>A modal should only care about hiding and displaying in front of or on top of other HTML elements</li>\n<li>The React components that use the modal should have the responsibility of what is in the modal and how to interact with it and let the modal perform it’s duties explained in the previous point</li>\n</ul>\n<p>Let’s implement point #2 so we can see how we’ll be using the pop-up modal.</p>\n<pre><code class=\"language-javascript\">handleSubmit(e, close) {\n  // process submit then call `close`\n}\nrender() {\n  return (\n    &#x3C;Modal\n      render=({ close }) => {\n        &#x3C;form onSubmit={(e) => this.handleSubmit(e, close)}>\n          &#x3C;input type=\"text\" name=\"username\">\n          &#x3C;input type=\"text\" name=\"password\">\n          &#x3C;button type=\"submit>Log In&#x3C;/button>\n        &#x3C;/form>\n      }\n    />\n  );\n}\n</code></pre>\n<p>This component renders a <code>Modal</code> component and provides a <code>render</code> function as a prop. You’ll see this in a second but essentially the <code>Modal</code> component will call the <code>render</code> function to render the form content you see above. We are saying, “hey Modal, here, take this render function. Render your content, then when you’re ready call the render function and I’ll take care of what it returns. Just provide me a close method please.”</p>\n<p>Before <code>render</code>, you’d have most of the logic, state, and HTML elements within the <code>Modal</code> component, or render children inside it, or create instances of HOC’s. With <code>render</code>, the <strong>parent is given the responsibility to render what logically should be viewed and controlled by them</strong>. This relieves the <code>Modal</code> from containing any irrelevant code besides it’s logic to open and close.</p>\n<p>More interestingly is that <code>Modal</code> can provide basically anything to the <code>render</code> function that the parent can utilize. In this example the <code>render</code> function contains a single object as it’s argument but you can imagine what else could be provided; especially in a more complex example.</p>\n<p>Let’s see what the <code>Modal</code> class looks like.</p>\n<pre><code class=\"language-javascript\">class Modal extends React.Component {\n  constructor(props) {\n    super(props)\n    this.state = { open: false };\n  }\n  open() {\n    this.setState({ open: true });\n  }\n  close() {\n    this.setState({ open: false });\n  }\n  render() {\n    const { open } = this.state;\n    const { render } = this.props;\n    return (\n      &#x3C;div>\n        &#x3C;button onClick={this.open}>Open&#x3C;/button>\n        {open &#x26;&#x26;\n          &#x3C;div className=\"modal\">\n            &#x3C;div className=\"bg\" />\n            &#x3C;div className=\"fg\">\n              {render({ close: this.close })}\n            &#x3C;/div>\n          &#x3C;/div>\n        }\n      &#x3C;/div>\n    );  \n  }\n}\n</code></pre>\n<p>Let’s assume all the styling for positioning, z-indexes, and displays are correctly set. I’ve placed some CSS classes to help explain what’s going on. Let’s review what we have here:</p>\n<ul>\n<li>initially the modal is not opened and only renders a button. The div with the class <code>modal</code> will not display since the modal state is not open.\nonce the button is clicked the modal will open and the div with the class <code>modal</code> will display. The div with the class <code>bg</code> will cover and blur the entire window while the div with the class <code>fg</code> will contain the modal content.</li>\n<li>the <code>render</code> function will get called with a single object with the <code>close</code> function as one of it’s properties.</li>\n</ul>\n<p>Pay close attention to the <code>render</code> prop. By calling this function with the <code>close</code> method, the modal is essentially allowing the parent to close the modal. It will be the parent components job to call at a later, more opportune time. In the example earlier, the parent component called <code>close</code> after the form was submitted. Sweet huh?</p>\n<h2>Let’s Review Our Example</h2>\n<p>The modal achieves it’s goals of opening and closing. It also shares this logic with parent components so they, too, can support those goals.</p>\n<p>The parent component provides, what I like to call, a “render callback prop” that allows us to achieve a few things:</p>\n<ul>\n<li>providing the modal component with a callback helps achieve the concept of separation of concern.</li>\n<li>aesthetically, the code we want to see in this component stays within it. It’s not in the modal component; a component that may exist in another file. To debug or visualize how the HTML content will display it is all in one place in the <code>render</code> function of the component.</li>\n<li>since the <code>render</code> callback prop is defined in the parent component it will continue to have access to it’s scope. This allowed the parent to call <code>this.handleSubmit</code> and at the same time, use variables provided by the modal.\nthe render callback prop was provided in-line. We could have easily created another component to utilize React’s lifecycle methods and provide that instead.</li>\n</ul>\n<h2>Conclusion</h2>\n<ul>\n<li><code>render</code> prop is another tool to add to your tool belt; use it when you need to. It’s use cases are similar to HOC’s but the approach is different.</li>\n<li>remember that every time the child’s <code>render</code> function is called so does the <code>render</code> callback prop. Furthermore, every render of the parent component adds to this number of renders as well.</li>\n</ul>\n<h2>Additional Resources:</h2>\n<ul>\n<li><a href=\"https://reactjs.org/docs/render-props.html\">https://reactjs.org/docs/render-props.html</a></li>\n<li><a href=\"https://cdb.reacttraining.com/use-a-render-prop-50de598f11ce\">https://cdb.reacttraining.com/use-a-render-prop-50de598f11ce</a></li>\n<li><a href=\"https://reacttraining.com/react-router/web/api/Route/render-func\">https://reacttraining.com/react-router/web/api/Route/render-func</a></li>\n<li><a href=\"https://reactjs.org/docs/higher-order-components.html\">https://reactjs.org/docs/higher-order-components.html</a></li>\n</ul>","frontmatter":{"title":"Learn React’s “Render” Prop Pattern By Building A Pop-Up Modal","date":"2018-05-06T18:01:07.000Z","tags":["react"]}}},"pageContext":{}}