{"data":{"markdownRemark":{"html":"<h2>From HTML to PDF</h2>\n<p>Creating simple PDFs programmatically is pretty easy. There are plenty of solutions out there that are simple to use. You give it some HTML and some CSS and \"BAM!\" you got a PDF. However, once you start incorporating multiple pages, high-quality vector graphics, custom fonts, and clever styling, creating PDFs becomes a nightmare.</p>\n<p>I've been tasked multiple times to lead the development of a PDF generation service. The development lifecycle would essentially look something like this:</p>\n<ul>\n<li>A designer creates a PDF design for a report a customer would download. The report contained multiple pages, tables with an arbitrary number of rows, complex graphs, custom fonts, and more.</li>\n<li>I take the design and generate the PDF dynamically.</li>\n</ul>\n<p>I've used a few open-source libraries to assist me in reaching this goal but I always ran into major issues. In this article I'll discuss some of those issues, the libraries I've used, the solution I use today, and other solutions I would consider in the future.</p>\n<h2>The Terrors of Creating PDFs</h2>\n<p>I'm a software engineer. That means I mainly work with browsers and servers. When I was first tasked with creating a PDF generation service I knew it would be a challenge because I've never programmatically generated print media such as PDFs. My only experience with creating PDFs was just like everyone elses: using Adobe, Microsoft, Apple, and other software to create PDFs using a GUI. So I was in for a real challenge.</p>\n<h3>HTML to PDF Libraries</h3>\n<p>I've used <code>wkhtmltopdf</code> in the past in production systems. I've investigated various libraries, both for the browser and on the server. I never had issues with any of the libraries I used specifically but more so the approach for how things were done to achieve the rendered PDF. For example:</p>\n<ul>\n<li>converting SVG graphics to raster images was highly suggested in the sofware community. However, it decreased the quality and altered size of the image.</li>\n<li></li>\n</ul>\n<p>to match designs is hard. If you've ever had to do this you probably agree with me.</p>\n<p>There are a lot of open-source libraries out there that enable you to generate PDFs. There is <code>wkhtmltopdf</code> that is a CLI tool that can be used on the server and plenty of other solutions for the browser. However, based on my experience I've kept facing the same issues:</p>\n<ul>\n<li></li>\n</ul>\n<h2>Future Possible Solutions</h2>\n<ul>\n<li>PrinceXML- licensing</li>\n<li>DocRaptor- licensing</li>\n</ul>","frontmatter":{"title":"Generating sophisticated PDFs with NodeJS and Puppeteer","date":"2020-04-15 08:00","tags":["nodejs","html","css"]}}},"pageContext":{}}