{"data":{"markdownRemark":{"html":"<p>In <a href=\"/blog/learning-go-for-nodejs-engineers-part-1\">Part 1</a> we covered the following Go topics:</p>\n<ul>\n<li>compiled language type</li>\n<li>static type system</li>\n<li>zero-values</li>\n<li>dependency management</li>\n<li>importing and exporting packages</li>\n<li>compiling and executing Go binaries and packages</li>\n<li>structs, arrays, slices, maps</li>\n<li>flow control</li>\n<li>type checking and assertions</li>\n</ul>\n<p>In Part 2 we will cover:</p>\n<ul>\n<li>pointers &#x26; pointer receivers</li>\n<li>interfaces</li>\n<li>error handling</li>\n<li>concurrency</li>\n</ul>\n<h2>Pointers</h2>\n<p>One major difference between Javascript and Golang is the concept of pointers. In Javascript, you don't have to worry about pointers. Everything, except arrays and objects, is passed by its value. For example:</p>\n<pre><code>function changeHobby(old) {\n  old = \"golang\"\n}\nlet old = \"node\"\nchangeHobby(old)\nconsole.log(old === \"golang\") // prints false\n</code></pre>\n<p>The function <code>changeHobby</code> mutates the <code>old</code> argument. The changes are only applied to that scoped variable and not to the same named variable outside the function because it was copied to it. The same functionality applies to this function if it was translated to Golang.</p>\n<pre><code>func changeHobby(old string) {\n  old = \"golang\"\n}\nold := \"node\"\nchangeHobby(old)\nfmt.Println(old == \"golang\") // prints false\n</code></pre>\n<h3>Pointers and Functions</h3>\n<p>In Golang, you can mutate the value at the address of a variable by using a pointer. A pointer is an object that contains the memory location of a variable.</p>\n<pre><code>func changeHobby(old *string) {\n  *old = \"golang\" // go to the memory address and change it\n}\nold := \"node\"\nchangeHobby(&#x26;old) // provide a pointer\nfmt.Println(old == \"golang\") // prints true\n</code></pre>\n<p>We provide <code>changeHobby</code> a pointer as an argument. It then takes the value at the address of <code>old</code> and replaces it with \"golang\".</p>\n<blockquote>\n<p>Pro Tip: The <code>&#x26;</code> operator references the address of a value and the <code>*</code> operator references the value at an address. I like the think the \"a\" in ampersand represents the \"a\" in address. This helps me differentiate between the two.</p>\n</blockquote>\n<h3>Pointers and Methods</h3>\n<p>In Javascript, you can change instance properties by simply changing it. Consider this pseudoclass:</p>\n<pre><code>const Dude = function(hobby) {\n  this.hobby = hobby\n}\n\nDude.prototype.changeHobby = function(newHobby) {\n  this.hobby = newHobby\n}\n\nconst dude = new Dude(\"node\")\ndude.changeHobby(\"golang\")\nconsole.log(dude.hobby === \"golang\") // prints true\n</code></pre>\n<p>In Go, you use <a href=\"https://tour.golang.org/methods/4\"><strong>pointer receiver methods</strong></a> to mutate the field values of a struct. For example:</p>\n<pre><code>type Dude struct {\n  Hobby string\n}\n\nfunc (d *Dude) changeHobby(h string) {\n  d.Hobby = h\n}\n\nd := Dude{\"node\"}\nd.changeHobby(\"golang\")\nfmt.Println(d.Hobby == \"golang\") // prints true\n</code></pre>\n<p>The method <code>func (d *Dude) changeHobby</code> is a pointer receiver method and uses a pointer (<code>d</code>) to mutate the values on the <code>Dude</code> struct.</p>\n<blockquote>\n<p>Pro Tip: The obvious use case for pointer receiver methods is to mutate the receiver. If in doubt, use a pointer receiver. Learn more about when to use pointer receiver methods in the <a href=\"https://github.com/golang/go/wiki/CodeReviewComments#receiver-type\">Go wiki</a></p>\n</blockquote>\n<h2>Interfaces</h2>\n<p>Javascript doesn't have interfaces (except for Typescript) but I think it's an important concept to introduce in an introduction to the language. Consider this struct:</p>\n<pre><code>type Human struct {}\nfunc (h *Human) Greet() string {\n  return \"Hello\" \n}\n</code></pre>\n<p>Let's create a function to accept the <code>Human</code> struct as an argument:</p>\n<pre><code>func Shout(h Human) string {\n  return d.Greet() + \"!\"\n}\n</code></pre>\n<p><code>Shout</code> is a simple function that accepts a <code>Human</code> and appends \"!\" to the string returned by <code>Greet</code>. Now, what if we wanted this same function to accept other types as well, how do we accomplish that? We could duplicate this function to accept a different struct type but that goes against the DRY principle. What do we do? Enter interfaces.</p>\n<p>A Go interface is a set of method signatures. A method signature defines a method name, the cardinality of arguments and the types of each. An interface describes the <em>behavior</em> of a type. Any type that implements <em>every</em> method in an interface definition is considered to satisfy that interface. Let's look at an example.</p>\n<pre><code>type Talker interface {\n  Greet() string\n}\n</code></pre>\n<p>The <code>Talker</code> interface has one method, <code>Greet</code> that returns a string. <code>Greet</code>'s method signature is that it takes zero arguments and returns a string. The <code>Human</code> struct we created above satisfies the <code>Talker</code> interface because it implements all methods defined in the interface. </p>\n<p>Let's create another struct that also satisfies this interface.</p>\n<pre><code>type Dog struct {}\nfunc (d *Dog) Greet() string {\n  return \"Ruff\" \n}\n</code></pre>\n<p>Now we can alter the <code>Shout</code> function to accept <code>Talker</code>'s.</p>\n<pre><code>func Shout(t Talker) string {\n  return t.Greet() + \"!\"\n}\n</code></pre>\n<p>We can now provide the function any types that satisfy this interface.</p>\n<pre><code>Shout(Human) // returns \"Hello!\"\nShout(Dog) // returns “Ruff!\"\n</code></pre>\n<p>Interfaces are great for achieving modularity, eliminating duplication, and mocking and stubbing in tests.</p>\n<h2>Error Handling</h2>\n<p>In Javascript, there are various ways to handle errors. Depending on the approach and context you can use:</p>\n<ul>\n<li><code>try</code>: to call functions that may throw errors themselves</li>\n<li><code>catch</code>: to catch those errors</li>\n<li><code>throw</code>: to throw errors</li>\n<li>the error argument in a callback</li>\n<li>the <code>catch</code> in Promises</li>\n</ul>\n<h3>Throw</h3>\n<p>Let's look at a Javascript function that throws an error:</p>\n<pre><code>function divide(a, b) {\n  if (b === 0) {\n   throw new Error(\"Cannot divide by zero\")\n  }\n  return a / b\n}\n</code></pre>\n<p><code>divide</code> divides two numbers but throws an error if the second argument is zero. A client invoking this function should be cautious since it's possible it could crash the program if the error is not avoided or is not handled correctly. Constructs like <code>try</code> and <code>catch</code> would need to be used to prevent this from happening.</p>\n<p>Golang handles errors quite differently from Javascript. It does have a construct called <code>panic</code>, that is loosely analogous to <code>throw</code>, but it is rarely used. Actually, how you use <code>throw</code> in Javascript is different than how you use <code>panic</code> in Go. The only cases I see <code>panic</code> being used is when it's not possible for your code or others integrating your code to continue. We'll soon revisit how programs can recover from <code>panic</code>'s.</p>\n<p>So if <code>panic</code> and <code>throw</code> aren't synonymous how should you handle errors? The Go convention for notifying callers that an error was encountered is for functions to return a tuple. That tuple contains one or more values for the success and a single value for the failure. The right-most value represents the failure and it is always an <code>error</code> type. Let's see an example:</p>\n<pre><code>func divide(a int, b int) (int, error) {\n  if b == 0 {\n    return -1, errors.New(\"Cannot divide by zero\")\n  }\n  return a / b, nil\n}\n</code></pre>\n<p>The <code>divide</code> function returns an <code>int</code> and an <code>error</code>; in that order. It doesn't raise an exception. The caller can be confident that it will not crash the program if it provides a zero as the second argument. The way you call this function looks like this:</p>\n<pre><code>n, err := divide(1, 2)\n</code></pre>\n<p><code>n</code> is the integer result and <code>err</code> is the error result. The existence of the error tells the caller something didn't go right. A <code>nil</code> value means that there was no error. An error exists if it is not <code>nil</code>.</p>\n<pre><code>n, err := divide(1, 2)\nif err != nil {\n  fmt.Println(\"Whoops, there was an error\")\n  return\n}\nfmt.Printf(\"The answer is %d\", n)\nreturn\n</code></pre>\n<p>After calling the function we immediately check if an error exists. We then handle it accordingly. Of course, the code above does not produce an error but providing the function with zero as the second argument would. </p>\n<blockquote>\n<p>Pro Tip: The Go convention is to handle errors immediately after they are encountered. You are discouraged from ignoring errors or simply just relaying them back to callers.</p>\n</blockquote>\n<p>For fun, let's rewrite the code above to show a common practice when using if-conditionals:</p>\n<pre><code>if n, err := divide(1, 2); err != nil {\n  fmt.Println(\"Whoops, there was an error\")\n} else {\n  fmt.Printf(\"The answer is %d\", n)\n}\nreturn\n</code></pre>\n<p>This is called a <em>compound if-statement</em> and it is super helpful if you only need the variables within the conditional and not outside it. After this conditional, the two variables <code>n</code> and <code>err</code> are not accessible because they'll be garbage collected. This neat feature isn't possible in Javascript.</p>\n<p>Let's revisit <code>panic</code>. </p>\n<h3>Panic</h3>\n<p>We will rewrite our <code>divide</code> function to use <code>panic</code>:</p>\n<pre><code>func divide(a int, b int) int {\n  if b == 0 {\n    panic(\"Cannot divide by zero\")\n  }\n  return a / b\n}\n</code></pre>\n<p>It now returns an integer and panics if <code>b</code> is zero. Now, if you did invoke this function with zero as the second argument how would you recover from this error? You would use <code>defer</code> and <code>recover</code>.</p>\n<blockquote>\n<p>Pro Tip: Only use a <code>panic</code> if it's best the program should crash immediately. Furthermore, when using a <code>panic</code> never assume a caller can resolve the error.</p>\n</blockquote>\n<h3>Defer</h3>\n<p>Javascript does not have a similar feature to <code>defer</code> so I'll just have to explain how it works. <code>defer</code> is a keyword that is prepended to a function allowing it to be executed after the surrounding function returns. <code>defer</code> is commonly used to simplify functions that perform various clean-up actions or to recover from panics. Let's see an example:</p>\n<pre><code>func createFile(filename string) error {\n  file, err := os.Create(filename)\n  if err != nil {\n    return err\n  }\n  defer file.Close()\n  return nil\n}\n</code></pre>\n<p>This function creates a file, checks for an error and returns it if one exist, runs <code>defer file.Close()</code>, then returns <code>nil</code>. The <code>defer</code> section allows the function <code>file.Close()</code> to be called after the surrounding function, <code>createFile</code>, returns. No matter what happens in this function, success or failure, <code>file.Close()</code> will be called. As a result, the file will always be closed after this function finishes. Neat huh? You'll see this a lot in I/O, concurrency, and exception recovery operations. Let's now see how this works with <code>panic</code> and <code>recover</code>.</p>\n<h3>Recover</h3>\n<p><code>recover</code> is a built-in function that regains control of a panicking goroutine. Recover is only useful inside deferred functions. Let's see an example by combining the above code with our <code>divide</code> function to create a file and write the contents of the <code>divide</code> function to it. I've redacted some of it to only show how we're using <code>recover</code>.</p>\n<pre><code>func createFile(filename string) (err error) {\n  defer func() {\n    if r := recover(); r != nil {\n      fmt.Println(\"Recovered from divide. Got error- \", r)\n      err = errors.New(\"File could not be created\")\n    }\n  }()\n\n  // ...\n\n  n := divide(1, 0) // this will panic\n\n  // ... code after this will not execute\n}\n</code></pre>\n<p>The first operation you see is a <code>defer</code> with an anonymous function. I'll explain the details of the contents of this function in a second. It then does some other stuff and eventually calls the <code>divide</code> function with zero as the second argument to cause it to panic.</p>\n<p>The anonymous function is called when the panic occurs because it was deferred. In it, we call the <code>recover</code> function. <code>recover</code> returns either <code>nil</code> or a string that was produced from a panic. If it returns <code>nil</code>, no panic was produced. If not, you have a chance to inspect the panic details and resume normal execution. Since a panic occurred in this code we print the panic details and return an error to the caller. The output of the above code is this:</p>\n<pre><code>\"Recovered from divide. Got error- Cannot divide by zero\"\n</code></pre>\n<blockquote>\n<p>Pro Tip: Deferred functions have access to the variables within the function it was called in. The deferred function above set the return error value to an error. You learned about named return values in Part 1.</p>\n</blockquote>\n<p>That's all for error handling in this article. Let's summarize it because we covered a lot: functions should avoid using <code>panic</code> but instead return a tuple that contains one or more success values and a single <code>error</code> value as the right-most value. Callers should always immediately check for an error and respond appropriately.</p>\n<blockquote>\n<p>Pro Tip: Surprisingly, there's really nothing unique about the <code>error</code> type. It's actually an interface (see the <a href=\"https://golang.org/pkg/builtin/#error\">built-in <code>error</code> interface</a> for more details). This interface is the simplest to satisfy as it only has a single method, <code>Error() string</code>. There are some really neat ways to implement and handle errors. Make sure to check out more practical examples at the Golang <a href=\"https://blog.golang.org/error-handling-and-go\">blog</a> and <a href=\"https://github.com/golang/go/wiki/Errors\">wiki</a>.</p>\n</blockquote>\n<h2>Concurrency</h2>\n<p>Javascript's event loop and the use of callbacks and promises allow it to accomplish concurrency.</p>\n<pre><code>function run(i) {\n  console.log(i)\n}\n\nconsole.log(0)\nfor (let i = 1; i &#x3C; 5; i++) {\n  setTimeout(run.bind(null, i), 0)\n}\nconsole.log(5)\n</code></pre>\n<p>We use <code>setTimeout</code> as an asynchronous function to place the <code>run</code> functions on the callback queue within the event loop. The result of this code is:</p>\n<pre><code>0\n5\n1\n2\n3\n4\n</code></pre>\n<p>Integers 0 and 5 were run synchronously and 1 through 4 were run asynchronously. To accomplish similar functionality in Go we'll use a goroutine.</p>\n<h3>Goroutine</h3>\n<p>A goroutine is a lightweight thread managed by the Go runtime. Creating a goroutine is as simple as prepending a function with the <code>go</code> keyword. </p>\n<pre><code>go helloWorld()\n</code></pre>\n<p>And that's it! Let's rewrite the Javascript code above to use goroutines.</p>\n<pre><code>func run(i int) {\n  fmt.Println(i)\n}\n\nfmt.Println(0)\nfor i := 1; i &#x3C; 5; i++ {\n  go run(i)\n}\nfmt.Println(5)\ntime.Sleep(time.Millisecond)\n</code></pre>\n<p>This runs four goroutines concurrently. We added a <code>time.Sleep</code> function call to sleep one millisecond because otherwise this code would finish and exit before the goroutines would themselves finish. However, the use of sleep calls to wait for goroutines to finish is an anti-pattern. </p>\n<p>To improve this code we need to get notified when these goroutines finish and wait until they do. We can communicate with goroutines by using <a href=\"https://tour.golang.org/concurrency/2\">channels</a>. Explaining channels and the many other concurrency constructs are outside the scope of this article, so we'll end our discussion of concurrency here.</p>\n<blockquote>\n<p>Pro Tip: The <code>main</code> function is itself a goroutine. Once this function returns any and all child goroutines get terminated </p>\n</blockquote>\n<h2>Part 2: Conclusion</h2>\n<p>In this article we’ve discussed Go’s:</p>\n<ul>\n<li>pointers &#x26; pointer receivers</li>\n<li>interfaces</li>\n<li>error handling</li>\n<li>concurrency</li>\n</ul>\n<p>Like Part 1, we’ve covered a lot in this article. If you’re unsure about a concept go back to the section, read it again, and follow the links and tips I’ve provided to learn more. If you’d like a more in-depth article in a specific topic just let me know below on Twitter.</p>\n<p>If you've come to the point where you're considering learning Golang take a look at the following resources. They are the perfect place to start next.</p>\n<ul>\n<li><a href=\"https://golang.org/doc\">Official Documenation</a></li>\n<li><a href=\"https://github.com/golang/go/wiki\">Golang Wiki</a></li>\n<li><a href=\"https://play.golang.org/\">Go Playground</a>- to quickly test, run, and share code snippets</li>\n</ul>","frontmatter":{"title":"Learning Go - For NodeJS Engineers (Part 2)","date":"2019-05-05T08:00:00.000Z","tags":["golang","javascript","nodejs"]}}},"pageContext":{}}